#Python - Non-technical introduction

##Day 3 Session 2: "Play with the Pros: How to use SQL for data wrangling?"

This file accompanies the lectures and provides the code for the corresponding slides.

*Note:* If you want to make changes to this document, you need to save your own copy using the "Save copy in Drive" command in the "File" menu.

###Preparation

**Make sure to run the follwing code before continuing.** Code will prepare everything (load data, ...).

In [ ]:
#load the sqlite3 package
import sqlite3
#load the numpy package
import numpy as np
#load the Pandas package
import pandas as pd


#Get the database file form Github and store it in the local working directory
!wget https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/database.sqlite

#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
#Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"], dayfirst=True)

--2021-09-01 06:01:29--  https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/database.sqlite
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 34689024 (33M) [application/octet-stream]
Saving to: ‘database.sqlite’

database.sqlite     100%[===================>]  33.08M   162MB/s    in 0.2s

2021-09-01 06:01:30 (162 MB/s) - ‘database.sqlite’ saved [34689024/34689024]

###29 - Select operations in SQL

####**Slide:** Selecting rows: Selecting rows by condition
. Identify transactions greater than $100

In [ ]:
import sqlite3

#We need to connect to the database again before we can move on:
con = sqlite3.connect(database="database.sqlite")
cursor= = con.cursor()

In [ ]:
pd.read_sql_query("SELECT * FROM transactions WHERE PurchAmount > 100;",con)

       Customer         TransDate  Quantity  ...    Cost    TransID  TransKey
0        149332  2005-11-15 00:00         1  ...  107.00  127998739    100000
1        172951  2008-08-29 00:00         1  ...  108.00  128888288    100001
2        140729  2009-11-19 00:00         1  ...   59.00  127637750    100005
3        180970  2009-06-19 00:00         1  ...   58.46  129195647    100011
4        182927  2009-02-11 00:00         1  ...   63.08  129290963    100017
...         ...               ...       ...  ...     ...        ...       ...
46287    199539  2012-09-16 00:00         1  ...   40.25  131972445    323164
46288    186343  2012-09-16 00:00         1  ...   63.00  129599231    323166
46289    186344  2012-09-16 00:00         1  ...   54.50  129599281    323167
46290    199996  2012-09-17 00:00         1  ...  104.99  132481133    323176
46291    199999  2012-09-17 00:00         1  ...  109.99  132481165    323189

[46292 rows x 7 columns]

####**Slide:** Selecting columns: Select multiple columns by column name

In [ ]:
pd.read_sql_query(" SELECT Customer, TransDate, PurchAmount FROM transactions;", con)

        Customer         TransDate  PurchAmount
0         149332  2005-11-15 00:00       199.95
1         172951  2008-08-29 00:00       199.95
2         120621  2007-10-19 00:00        99.95
3         149236  2005-11-14 00:00        39.95
4         149236  2007-06-12 00:00        79.95
...          ...               ...          ...
223186    199997  2012-09-17 00:00        29.95
223187    199997  2012-09-17 00:00        29.95
223188    199998  2012-09-17 00:00        29.95
223189    199999  2012-09-17 00:00       179.95
223190    199542  2012-09-17 00:00        39.95

[223191 rows x 3 columns]

####**Slide:** Selecting rows and columns: Combine operations to select by row and column

In [ ]:
pd.read_sql_query("SELECT TransDate, Cost FROM transactions WHERE PurchAmount > 100;", con)

              TransDate    Cost
0      2005-11-15 00:00  107.00
1      2008-08-29 00:00  108.00
2      2009-11-19 00:00   59.00
3      2009-06-19 00:00   58.46
4      2009-02-11 00:00   63.08
...                 ...     ...
46287  2012-09-16 00:00   40.25
46288  2012-09-16 00:00   63.00
46289  2012-09-16 00:00   54.50
46290  2012-09-17 00:00  104.99
46291  2012-09-17 00:00  109.99

[46292 rows x 2 columns]

####**Slide:** Updating rows and columns: Appending rows into a table

In [ ]:
cursor=.execute("INSERT INTO transactions (Customer,TransDate,Quantity,PurchAmount,Cost) VALUES (80801,'2014-09-19 00:00',1,89.95,29.30);")
con.commit()

####**Slide:** Updating rows and columns: Adding columns to a table

In [ ]:
cursor=.execute("ALTER TABLE transactions ADD NewCol;")
cursor=.execute("UPDATE transactions SET NewCol=ROUND(Cost,0);")
con.commit()

###30 - Aggregate operations in SQL

####**Slide:** 1. Apply an aggregating function to a variable by an aggregating dimension

In [ ]:
pd.read_sql_query("SELECT Customer, SUM(PurchAmount) AS AggPurch FROM transactions GROUP BY Customer;", con)

       Customer  AggPurch
0         80801     89.95
1        100001    279.90
2        100002    499.95
3        100003    379.90
4        100004    499.95
...         ...       ...
98776    199995     89.85
98777    199996    179.95
98778    199997    179.70
98779    199998     29.95
98780    199999    179.95

[98781 rows x 2 columns]

####**Slide:** 2. Apply an aggregating function to multiple variables by an aggregating dimension

In [ ]:
pd.read_sql_query("SELECT Customer, SUM(PurchAmount) AS AggPurch, SUM(Quantity) AS AggQuant FROM transactions GROUP BY Customer;", con)

       Customer  AggPurch  AggQuant
0         80801     89.95         1
1        100001    279.90         2
2        100002    499.95         1
3        100003    379.90         2
4        100004    499.95         1
...         ...       ...       ...
98776    199995     89.85         3
98777    199996    179.95         1
98778    199997    179.70         6
98779    199998     29.95         1
98780    199999    179.95         1

[98781 rows x 3 columns]

####**Slide:** 3. Apply an aggregating function by a transformed aggregating dimension

In [ ]:
pd.read_sql_query("SELECT date(TransDate, 'start of month') AS Month, SUM(PurchAmount) AS AggPurch FROM transactions GROUP BY Month;", con)

         Month  AggPurch
0   2004-12-01  27623.90
1   2005-01-01  83363.73
2   2005-02-01  87341.59
3   2005-03-01  86803.31
4   2005-04-01  84293.01
..         ...       ...
93  2012-09-01  71429.25
94  2012-10-01  42588.75
95  2012-11-01  44633.30
96  2012-12-01  41652.75
97  2014-09-01     89.95

[98 rows x 2 columns]